{
  "Wood_Wood": {
    "title": "Forest Alliance",
    "score": 75,
    "desc": "Wood meets Wood. It represents friends, siblings, or competitors. You will find strength in numbers today, but ensure you don't get lost in the crowd.",
    "advice": "Network and collaborate."
  },
  "Wood_Fire": {
    "title": "Blossoming Creativity",
    "score": 90,
    "desc": "Wood feeds Fire. Your energy flows out naturally to create something bright. It is an excellent day for expression, performance, and sharing ideas.",
    "advice": "Don't hide your talents."
  },
  "Wood_Earth": {
    "title": "Rooting Success",
    "score": 85,
    "desc": "Wood controls Earth. You have the power to conquer obstacles and claim your territory. Financial opportunities are high as you can manage resources well.",
    "advice": "Focus on results and profit."
  },
  "Wood_Metal": {
    "title": "Pruning & Shaping",
    "score": 50,
    "desc": "Metal chops Wood. You might feel criticized or restricted by rules. However, just as a tree needs pruning to grow tall, this pressure can refine you.",
    "advice": "Follow the rules today."
  },
  "Wood_Water": {
    "title": "Nourishing Rain",
    "score": 95,
    "desc": "Water feeds Wood. You are fully supported by your environment. Mentors, documents, or knowledge will help you grow without much effort.",
    "advice": "Learn and accept help."
  },

  "Fire_Wood": {
    "title": "Fuel for Passion",
    "score": 95,
    "desc": "Wood feeds Fire. You have endless resources and energy supporting you. Whatever you start today will burn bright with the help of others.",
    "advice": "Start new projects."
  },
  "Fire_Fire": {
    "title": "Intense Blaze",
    "score": 70,
    "desc": "Fire meets Fire. The energy is explosive and passionate but can be competitive. Watch your temper, but use this drive to speed up your work.",
    "advice": "Control your emotions."
  },
  "Fire_Earth": {
    "title": "Productive Ash",
    "score": 85,
    "desc": "Fire creates Earth. Your efforts produce tangible results. It is a day of 'output' where your hard work settles into something real and valuable.",
    "advice": "Focus on practical outcomes."
  },
  "Fire_Metal": {
    "title": "Forging Gold",
    "score": 80,
    "desc": "Fire melts Metal. You have the upper hand to reshape challenging situations. It represents financial gain through effort and control.",
    "advice": "Take charge of the situation."
  },
  "Fire_Water": {
    "title": "Steam & Fog",
    "score": 45,
    "desc": "Water extinguishes Fire. You may feel dampened by authority or unexpected obstacles. Your passion might be blocked, causing frustration.",
    "advice": "Stay low and conserve energy."
  },

  "Earth_Wood": {
    "title": "Under Pressure",
    "score": 50,
    "desc": "Wood breaks Earth. You might feel burdened by responsibilities or people demanding things from you. Stress levels could be high.",
    "advice": "Prioritize your mental health."
  },
  "Earth_Fire": {
    "title": "Warm Support",
    "score": 95,
    "desc": "Fire feeds Earth. You are being energized and supported. Documents, contracts, or recognition from superiors are likely today.",
    "advice": "Ask for what you deserve."
  },
  "Earth_Earth": {
    "title": "Solid Mountain",
    "score": 75,
    "desc": "Earth meets Earth. You stand firm and unshakeable. It represents trust and stability, but can also mean stagnation if you don't move.",
    "advice": "Stick to your principles."
  },
  "Earth_Metal": {
    "title": "Mining Treasures",
    "score": 85,
    "desc": "Earth generates Metal. Your hidden talents or investments are coming to the surface. It is a good day to show what you have produced.",
    "advice": "Showcase your work."
  },
  "Earth_Water": {
    "title": "Controlling the Flow",
    "score": 80,
    "desc": "Earth blocks Water. You are in a position to manage finances or control a chaotic situation. You have the upper hand in negotiations.",
    "advice": "Be firm in your decisions."
  },

  "Metal_Wood": {
    "title": "Harvest Time",
    "score": 85,
    "desc": "Metal chops Wood. This represents harvest and financial gain. You can cut through confusion and achieve your goals efficiently.",
    "advice": "Execute your plans."
  },
  "Metal_Fire": {
    "title": "The Furnace",
    "score": 50,
    "desc": "Fire melts Metal. You are being tested. Pressure from bosses or the system is strong. It is uncomfortable but can transform you into something better.",
    "advice": "Endure and refine yourself."
  },
  "Metal_Earth": {
    "title": "Buried Treasure",
    "score": 95,
    "desc": "Earth feeds Metal. You are protected and validated. It is a day of receiving resources, validation, or rest without needing to fight.",
    "advice": "Refresh and recharge."
  },
  "Metal_Metal": {
    "title": "Clashing Swords",
    "score": 70,
    "desc": "Metal meets Metal. The energy is sharp and competitive. You might meet a rival or a strong partner. Decisions will be made quickly.",
    "advice": "Choose your battles wisely."
  },
  "Metal_Water": {
    "title": "Polished Flow",
    "score": 90,
    "desc": "Metal generates Water. Your logic and speech are flowing perfectly. It is a great day for persuasion, sales, or verbal expression.",
    "advice": "Speak up, people are listening."
  },

  "Water_Wood": {
    "title": "Creative Growth",
    "score": 90,
    "desc": "Water feeds Wood. Your ideas are nourishing a new project. It is a gentle, creative day where your input helps things grow.",
    "advice": "Nurture your ideas."
  },
  "Water_Fire": {
    "title": "Wealth & Control",
    "score": 85,
    "desc": "Water controls Fire. You can manage the energy around you effectively. It is a prime day for financial planning or achieving goals.",
    "advice": "Be bold in your actions."
  },
  "Water_Earth": {
    "title": "The Dam",
    "score": 50,
    "desc": "Earth blocks Water. You might feel stuck or restricted by rules. Movement is slow. Use this time to reflect rather than force things.",
    "advice": "Patience is key."
  },
  "Water_Metal": {
    "title": "Clear Source",
    "score": 95,
    "desc": "Metal generates Water. Your mind is crystal clear. You have strong backing and logic on your side. Ideal for studying or planning.",
    "advice": "Trust your intuition."
  },
  "Water_Water": {
    "title": "Deep Ocean",
    "score": 70,
    "desc": "Water meets Water. A day of deep emotions or social connection. You might feel overwhelmed or very connected to others.",
    "advice": "Go with the flow."
  }
}